package com._plus1.domain.song.model.enums;

import java.util.List;

public enum GlobalPopularGenreCode {

    // 수정 시, 최하단의 주석을 참고하고 함께 수정할 것!

    // POP
    POP(
            "POP",
            List.of(
                    "GN0900", "GN0901", "GN0902", "GN0903", "GN0904",
                    "GN0905", "GN0906", "GN0907", "GN0908"
            )
    ),

    // 록 / 메탈
    ROCK_METAL(
            "록/메탈",
            List.of(
                    "GN1000", "GN1001", "GN1002", "GN1003", "GN1004",
                    "GN1005", "GN1006", "GN1007", "GN1008",
                    "GN1009", "GN1010", "GN1011", "GN1012",
                    "GN1013", "GN1014"
            )
    ),

    // 일렉트로니카
    ELECTRONICA(
            "일렉트로니카",
            List.of(
                    "GN1100", "GN1101", "GN1102", "GN1103", "GN1104",
                    "GN1105", "GN1106", "GN1107", "GN1108", "GN1109"
            )
    ),

    // 랩 / 힙합
    HIPHOP(
            "랩/힙합",
            List.of(
                    "GN1200", "GN1201", "GN1202", "GN1203", "GN1204",
                    "GN1205", "GN1206", "GN1207", "GN1208", "GN1209"
            )
    ),

    // R&B / Soul
    RNB_SOUL(
            "R&B/Soul",
            List.of(
                    "GN1300", "GN1301", "GN1302", "GN1303", "GN1304",
                    "GN1305", "GN1306", "GN1307", "GN1308"
            )
    ),

    // 포크 / 블루스 / 컨트리
    FOLK_BLUES_COUNTRY(
            "포크/블루스/컨트리",
            List.of(
                    "GN1400", "GN1401", "GN1402", "GN1403", "GN1404",
                    "GN1405", "GN1406", "GN1407"
            )
    ),

    // J-POP
    J_POP(
            "J-POP",
            List.of(
                    "GN1900", "GN1901", "GN1902", "GN1903", "GN1904",
                    "GN1905", "GN1906", "GN1907", "GN1908", "GN1909",
                    "GN1910", "GN1911", "GN1912"
            )
    ),

    // 월드뮤직
    WORLD_MUSIC(
            "월드뮤직",
            List.of(
                    "GN2000", "GN2001", "GN2002", "GN2003"
            )
    ),

    // 국외 뮤지컬
    GLOBAL_MUSICAL(
            "국외뮤지컬",
            List.of("GN2903")
    ),

    // 크리스마스
    CHRISTMAS(
            "크리스마스",
            List.of("GN3000")
    );

    private final String displayName;
    private final List<String> genreCodes;

    GlobalPopularGenreCode(String displayName, List<String> genreCodes) {
        this.displayName = displayName;
        this.genreCodes = genreCodes;
    }

    public String getDisplayName() {
        return displayName;
    }

    public List<String> getGenreCodes() {
        return genreCodes;
    }

//    해외 POP음악 범위 :
//
//            "GN0900": "POP",
//            "GN0901": "세부장르전체",
//            "GN0902": "얼터너티브팝",
//            "GN0903": "올디스",
//            "GN0904": "월드팝",
//            "GN0905": "'60-'70",
//            "GN0906": "'80-'90",
//            "GN0907": "'00",
//            "GN0908": "'10-",
//
//            "GN1000": "록/메탈",
//            "GN1001": "세부장르전체",
//            "GN1002": "모던록",
//            "GN1003": "얼터너티브록",
//            "GN1004": "프로그레시브/아트록",
//            "GN1005": "하드록",
//            "GN1006": "헤비메탈",
//            "GN1007": "뉴메탈/하드코어",
//            "GN1008": "포스트록",
//            "GN1009": "'60",
//            "GN1010": "'70",
//            "GN1011": "'80",
//            "GN1012": "'90",
//            "GN1013": "'00",
//            "GN1014": "'10-",
//
//            "GN1100": "일렉트로니카",
//            "GN1101": "세부장르전체",
//            "GN1102": "일렉트로니카",
//            "GN1103": "하우스",
//            "GN1104": "클럽뮤직",
//            "GN1105": "일렉트로닉팝",
//            "GN1106": "'80",
//            "GN1107": "'90",
//            "GN1108": "'00",
//            "GN1109": "'10-",
//
//            "GN1200": "랩/힙합",
//            "GN1201": "세부장르전체",
//            "GN1202": "팝랩",
//            "GN1203": "얼터너티브힙합",
//            "GN1204": "갱스터/하드코어랩",
//            "GN1205": "East&West",
//            "GN1206": "'80",
//            "GN1207": "'90",
//            "GN1208": "'00",
//            "GN1209": "'10-",
//
//            "GN1300": "R&B/Soul",
//            "GN1301": "세부장르전체",
//            "GN1302": "컨템포러리 R&B",
//            "GN1303": "소울",
//            "GN1304": "어반",
//            "GN1305": "'60-'70",
//            "GN1306": "'80-'90",
//            "GN1307": "'00",
//            "GN1308": "'10-",
//
//            "GN1400": "포크/블루스/컨트리",
//            "GN1401": "세부장르전체",
//            "GN1402": "포크",
//            "GN1403": "블루스",
//            "GN1404": "컨트리",
//            "GN1405": "'60-'70",
//            "GN1406": "'80-'90",
//            "GN1407": "'00-",
//
//
//            "GN1900": "J-POP",
//            "GN1901": "세부장르전체",
//            "GN1902": "POP",
//            "GN1903": "록",
//            "GN1904": "일렉트로니카",
//            "GN1905": "랩/힙합",
//            "GN1906": "R&B/Soul",
//            "GN1907": "시부야케이",
//            "GN1908": "뉴에이지",
//            "GN1909": "재즈",
//            "GN1910": "힙합/R&B",
//            "GN1911": "'80-'90",
//            "GN1912": "'00-'10",
//
//            "GN2000": "월드뮤직",
//            "GN2001": "세부장르전체",
//            "GN2002": "샹송/프렌치팝",
//            "GN2003": "칸초네/이탈리안팝",
//
//            "GN2903": "국외뮤지컬",
//
//            "GN3000": "크리스마스"

    }
